SpenceKonde/ATTinyCore/avr/boards.txt
attinyx7opti.name=ATtiny167/87 (Optiboot)
attinyx7opti.upload.maximum_data_size=512
attinyx7opti.upload.protocol=arduino
attinyx7opti.upload.tool=avrdude
attinyx7opti.build.board=AVR_ATTINYX7
attinyx7opti.bootloader.tool=avrdude
attinyx7opti.bootloader.unlock_bits=0xFF
attinyx7opti.bootloader.lock_bits=0xFF
attinyx7opti.build.core=tiny
attinyx7opti.bootloader.extended_fuses=0xFE
attinyx7opti.menu.LTO.enable=Enabled
attinyx7opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx7opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx7opti.menu.LTO.enable.ltocppflags=-flto
attinyx7opti.menu.LTO.enable.ltoarcmd=gcc-
attinyx7opti.menu.LTO.disable=Disabled
attinyx7opti.menu.LTO.disable.ltocflags=
attinyx7opti.menu.LTO.disable.ltoelfflags=
attinyx7opti.menu.LTO.disable.ltocppflags=
attinyx7opti.menu.LTO.disable.ltoarcmd=
attinyx7opti.menu.chip.167=ATtiny167
attinyx7opti.menu.chip.167.build.mcu=attiny167
attinyx7opti.menu.chip.167.build.export_merged_output=false
attinyx7opti.menu.chip.167.upload.maximum_size=15744
attinyx7opti.menu.chip.87=ATtiny87
attinyx7opti.menu.chip.87.build.mcu=attiny87
attinyx7opti.menu.chip.87.build.export_merged_output=true
attinyx7opti.menu.chip.87.upload.maximum_size=7552
attinyx7opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx7opti.menu.clock.8internal=8 MHz (internal)
attinyx7opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx7opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx7opti.menu.clock.8internal.upload.speed=57600
attinyx7opti.menu.clock.8internal.build.clocksource=0
attinyx7opti.menu.clock.16external=16 MHz (external)
attinyx7opti.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.16external.build.f_cpu=16000000L
attinyx7opti.menu.clock.16external.upload.speed=115200
attinyx7opti.menu.clock.16external.build.clocksource=1
attinyx7opti.menu.clock.12external=12 MHz (external)
attinyx7opti.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.12external.build.f_cpu=12000000L
attinyx7opti.menu.clock.12external.upload.speed=115200
attinyx7opti.menu.clock.12external.build.clocksource=1
attinyx7opti.menu.clock.8external=8 MHz (external)
attinyx7opti.menu.clock.8external.bootloader.low_fuses=0xFD
attinyx7opti.menu.clock.8external.build.f_cpu=8000000L
attinyx7opti.menu.clock.8external.upload.speed=57600
attinyx7opti.menu.clock.8external.build.clocksource=1
attinyx7opti.menu.clock.737external=7.3728 MHz (external)
attinyx7opti.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx7opti.menu.clock.737external.build.f_cpu=7372800L
attinyx7opti.menu.clock.737external.upload.speed=57600
attinyx7opti.menu.clock.737external.build.clocksource=1
attinyx7opti.menu.clock.921external=9.216 MHz (external)
attinyx7opti.menu.clock.921external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.921external.build.f_cpu=9216000L
attinyx7opti.menu.clock.921external.upload.speed=57600
attinyx7opti.menu.clock.921external.build.clocksource=1
attinyx7opti.menu.clock.110external=11.0592 MHz (external)
attinyx7opti.menu.clock.110external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.110external.build.f_cpu=11059200L
attinyx7opti.menu.clock.110external.upload.speed=115200
attinyx7opti.menu.clock.110external.build.clocksource=1
attinyx7opti.menu.clock.147external=14.7456 MHz (external)
attinyx7opti.menu.clock.147external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.147external.build.f_cpu=14745600L
attinyx7opti.menu.clock.147external.upload.speed=115200
attinyx7opti.menu.clock.147external.build.clocksource=1
attinyx7opti.menu.clock.184external=18.432 MHz (external - overclocked)
attinyx7opti.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx7opti.menu.clock.184external.build.f_cpu=18432000L
attinyx7opti.menu.clock.184external.upload.speed=115200
attinyx7opti.menu.clock.184external.build.clocksource=1
attinyx7opti.menu.bod.disable=B.O.D. Disabled (saves power)
attinyx7opti.menu.bod.disable.bootloader.high_fuses=0xD7
attinyx7opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7opti.menu.bod.1v8.bootloader.high_fuses=0xD6
attinyx7opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7opti.menu.bod.2v7.bootloader.high_fuses=0xD5
attinyx7opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7opti.menu.bod.4v3.bootloader.high_fuses=0xD4
attinyx7opti.menu.pinmapping.new=New style (down each side)
attinyx7opti.menu.pinmapping.new.build.variant=tinyX7_New
attinyx7opti.menu.pinmapping.old=Old style (SCL on 13)
attinyx7opti.menu.pinmapping.old.build.variant=tinyX7
attinyx7opti.menu.pinmapping.digi=DigiSpark Pro
attinyx7opti.menu.pinmapping.digi.build.variant=tinyX7_DigiSpark
attinyx7opti.menu.millis.enabled=Enabled
attinyx7opti.menu.millis.disabled=Disabled (saves flash)
attinyx7opti.menu.millis.enabled.build.millis=
attinyx7opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx7opti.menu.neopixelport.porta=Port A (see chart)
attinyx7opti.menu.neopixelport.portb=Port B (see chart)
attinyx7opti.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx7opti.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx7opti.build.extra_flags={build.millis} {build.neopixelport}


attinyx7micr.name=ATtiny167 (Micronucleus / DigiSpark Pro)
attinyx7micr.upload.maximum_size=14844
attinyx7micr.upload.maximum_data_size=512
attinyx7micr.upload.tool=micronucleus
attinyx7micr.upload.protocol=usb
attinyx7micr.build.board=AVR_ATTINYX7
attinyx7micr.bootloader.tool=avrdude
attinyx7micr.bootloader.unlock_bits=0xFF
attinyx7micr.bootloader.lock_bits=0xFF
attinyx7micr.build.core=tiny
attinyx7micr.bootloader.extended_fuses=0xFE
attinyx7micr.menu.LTO.enable=Enabled
attinyx7micr.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx7micr.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx7micr.menu.LTO.enable.ltocppflags=-flto
attinyx7micr.menu.LTO.enable.ltoarcmd=gcc-
attinyx7micr.menu.LTO.disable=Disabled
attinyx7micr.menu.LTO.disable.ltocflags=
attinyx7micr.menu.LTO.disable.ltoelfflags=
attinyx7micr.menu.LTO.disable.ltocppflags=
attinyx7micr.menu.LTO.disable.ltoarcmd=
attinyx7micr.build.mcu=attiny167
attinyx7micr.build.export_merged_output=false
attinyx7micr.bootloader.file=empty/empty_all.hex
attinyx7micr.bootloader.low_fuses=0xFF
attinyx7micr.build.f_cpu=16000000L
attinyx7micr.upload.speed=115200
attinyx7micr.build.clocksource=1
attinyx7micr.bootloader.high_fuses=0xD7
attinyx7micr.build.variant=tinyX7_DigiSpark
attinyx7micr.menu.millis.enabled=Enabled
attinyx7micr.menu.millis.disabled=Disabled (saves flash)
attinyx7micr.menu.millis.enabled.build.millis=
attinyx7micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx7micr.menu.neopixelport.porta=Port A (see chart)
attinyx7micr.menu.neopixelport.portb=Port B (see chart)
attinyx7micr.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx7micr.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx7micr.build.extra_flags={build.millis} {build.neopixelport}


